app/views/list_event_master/show.html.erb

SELECT "event_ticket_types".* FROM "event_ticket_types"  WHERE "event_ticket_types"."event_master_id" = $1  [["event_master_id", 8]]
---
<%= @event_master.url %>
<% @event_master.event_ticket_types.each do | event_ticket_types | %>