app/views/sub_categories/_form.html.erb

    <%= f.label :category_id %><br>
    <%= f.select :category_id, Category.all.collect {|s| [s.name, s.id]}, :include_blank => '-Please Select-' %>
---
SELECT "categories".* FROM "categories"