app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    @category.save
---
INSERT INTO "categories" ("created_at", "description", "name", "status", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-04-26 13:00:35.260807"], ["description", "Category1"], ["name", "Category1"], ["status", 1], ["updated_at", "2015-04-26 13:00:35.260807"]]