app/controllers/event_ticket_types_controller.rb

INSERT INTO "event_ticket_types" ("created_at", "event_master_id", "max", "min", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2015-04-27 18:09:53.925469"], ["event_master_id", 28], ["max", 0], ["min", 10], ["name", "ljl"], ["price", 100], ["updated_at", "2015-04-27 18:09:53.925469"]]
---
  def create
    @event_ticket_type = @event_master.event_ticket_types.new(event_ticket_type_params)
    respond_to do |format|
      if @event_ticket_type.save

UPDATE "event_ticket_types" SET "end_time" = $1, "start_time" = $2, "updated_at" = $3 WHERE "event_ticket_types"."id" = 5  [["end_time", "2015-04-15 16:17:00.000000"], ["start_time", "2013-11-28 15:16:00.000000"], ["updated_at", "2015-05-05 20:07:57.370476"]]
---
  def update
    respond_to do |format|
      if @event_ticket_type.update(event_ticket_type_params)

DELETE FROM "event_ticket_types" WHERE "event_ticket_types"."id" = $1  [["id", 1]]
---
  def destroy
    @event_ticket_type.destroy

SELECT  "event_masters".* FROM "event_masters"  WHERE "event_masters"."id" = $1 LIMIT 1  [["id", 28]]
---
  def load_event_master
    @event_master = EventMaster.find(params[:event_master_id])

SELECT  "event_ticket_types".* FROM "event_ticket_types"  WHERE "event_ticket_types"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_event_ticket_type
      @event_ticket_type = EventTicketType.find(params[:id])