app/controllers/event_ticket_types_controller.rb

  def index
    @event_ticket_types = EventTicketType.all
---
SELECT "event_ticket_types".* FROM "event_ticket_types"