app/controllers/event_masters_controller.rb

  def index
    @event_masters = EventMaster.all
---
SELECT "event_masters".* FROM "event_masters"

  def create
    @event_master = current_user.event_masters.new(event_master_params)
    p "event_master_paramsevent_master_paramsevent_master_paramsevent_master_params"
    p event_master_params
    p event_master_params[:event_category_mappings_attributes]
    @event_master.save
---
INSERT INTO "event_masters" ("created_at", "description", "private", "title", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2015-04-01 19:38:44.483659"], ["description", ""], ["private", "f"], ["title", "sssss"], ["updated_at", "2015-04-01 19:38:44.483659"], ["url", ""], ["user_id", 1]]

  def update
    @event_master.update(event_master_params)
---
UPDATE "event_masters" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "event_masters"."id" = 1  [["image_file_name", "Penguins.jpg"], ["image_file_size", 777835], ["image_updated_at", "2015-04-26 15:12:32.980469"], ["updated_at", "2015-04-26 15:12:36.134673"]]

  def destroy
    @event_master.destroy
---
DELETE FROM "event_masters" WHERE "event_masters"."id" = $1  [["id", 8]]

    def set_event_master
      @event_master = EventMaster.find(params[:id])
---
SELECT  "event_masters".* FROM "event_masters"  WHERE "event_masters"."id" = $1 LIMIT 1  [["id", 8]]