app/controllers/list_event_master_controller.rb

  def index
  	@event_master = EventMaster.latest_events.page(params[:page]).per_page(10)
---
SELECT  "event_masters".* FROM "event_masters"   ORDER BY updated_at desc, title desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "event_masters"

    def set_event_master
      @event_master = EventMaster.find(params[:id])
---
SELECT  "event_masters".* FROM "event_masters"  WHERE "event_masters"."id" = $1 LIMIT 1  [["id", 1]]