app/controllers/list_event_master_controller.rb

SELECT  "event_masters".* FROM "event_masters"   ORDER BY updated desc LIMIT 1
---
  def index
  	@event_master = EventMaster.all.paginate(:page => params[:page], :per_page => 10)