app/controllers/sub_categories_controller.rb

  def index
    @sub_categories = SubCategory.all
---
SELECT "sub_categories".* FROM "sub_categories"

  def create
    @sub_category = SubCategory.new(sub_category_params)
    @sub_category.save
---
INSERT INTO "sub_categories" ("category_id", "created_at", "description", "name", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category_id", 1], ["created_at", "2015-04-26 13:01:32.953862"], ["description", "Sub category1"], ["name", "Sub category1"], ["status", 1], ["updated_at", "2015-04-26 13:01:32.953862"]]

    def set_sub_category
      @sub_category = SubCategory.find(params[:id])
---
SELECT  "sub_categories".* FROM "sub_categories"  WHERE "sub_categories"."id" = $1 LIMIT 1  [["id", 1]]