app/views/event_masters/_form.html.erb

SELECT "sub_categories".* FROM "sub_categories"
---
  	<%= f.semantic_fields_for :event_category_mappings do |ecm| %>
      <%= ecm.select :categories_id, Category.all.collect {|s| [s.name, s.id]},:input_html => {:onchange => '$.get("#")'}, :include_blank => '-Please Select-' %>